# DocDropShadowByCls

```pascal
FUNCTION DocDropShadowByCls : BOOLEAN;
```

```python
def vs.DocDropShadowByCls():
    return BOOLEAN
```

## Examples
```pascal
resultOK := DocDropShadowByCls;
```
```python
import vs

ok = vs.DocDropShadowByCls()
if ok:
    vs.Message('DocDropShadowByCls succeeded')
else:
    vs.Message('DocDropShadowByCls failed')
```

## Version
Availability: from Vectorworks 2017

## Category
* Document Attributes